USE EatTogetherDB;
GO
-- =============================================
-- 20_MemberCoupons.sql
-- =============================================

SET IDENTITY_INSERT [dbo].[MemberCoupons] ON;
GO

INSERT INTO [dbo].[MemberCoupons] ([Id], [MemberId], [CouponId], [IsUsed], [UsedDate]) VALUES 
-- 【已使用的優惠券紀錄 (IsUsed = 1)】
(1, 1, 1, 1, '2024-02-14 19:30:00'),  -- 陳美玲 用了新會員禮
(2, 2, 1, 1, '2024-03-10 12:15:00'),  -- 林柏宇 用了新會員禮
(3, 3, 4, 1, '2024-10-10 18:45:00'),  -- 吳欣怡 用了2024開幕慶
(4, 4, 4, 1, '2024-12-24 20:00:00'),  -- 黃大衛 用了2024開幕慶
(5, 5, 2, 1, '2024-09-10 19:30:00'),  -- 張雅惠(9月生日) 用了壽星券
(6, 6, 7, 1, '2025-12-25 18:30:00'),  -- 劉宗翰 用了2025聖誕券
(7, 8, 6, 1, '2025-08-08 19:00:00'),  -- 蔡明輝 用了2025父親節券
(8, 9, 1, 1, '2024-06-15 12:30:00'),  -- 鄭佳蓉 用了新會員禮
(9, 10, 5, 1, '2025-05-10 18:00:00'), -- 楊俊豪 用了2025母親節券
(10, 11, 8, 1, '2026-02-14 19:00:00'),-- 李佳欣 用了2026情人節券
(11, 12, 9, 1, '2026-02-05 18:30:00'),-- 王俊廷 用了2026新春券
(12, 13, 8, 1, '2026-02-14 20:15:00'),-- 郭雅婷 用了2026情人節券
(13, 14, 9, 1, '2026-01-20 12:00:00'),-- 方彥霖 用了2026新春券
(14, 15, 1, 1, '2024-09-20 18:45:00'),-- 唐詩涵 用了新會員禮
(15, 16, 7, 1, '2025-12-31 21:00:00'),-- 羅建志 用了2025聖誕券

-- 【持有中 / 尚未使用 (IsUsed = 0)】
-- (包含尚未到期、永久有效，或放到過期沒用的)
(16, 1, 10, 0, NULL), -- 陳美玲 領了春季券
(17, 1, 3, 0, NULL),  -- 陳美玲 是VIP，有專屬券
(18, 2, 10, 0, NULL), -- 林柏宇 領了春季券
(19, 3, 11, 0, NULL), -- 吳欣怡 領了白色情人節券
(20, 4, 2, 0, NULL),  -- 黃大衛(2月生日) 領了壽星券
(21, 5, 8, 0, NULL),  -- 張雅惠 領了情人節券但沒用到
(22, 6, 10, 0, NULL), -- 劉宗翰 領了春季券
(23, 7, 1, 0, NULL),  -- 許雅柔 剛註冊，新會員禮還在
(24, 7, 10, 0, NULL), -- 許雅柔 領了春季券
(25, 8, 10, 0, NULL), -- 蔡明輝 領了春季券
(26, 9, 11, 0, NULL), -- 鄭佳蓉 領了白色情人節券
(27, 10, 12, 0, NULL),-- 楊俊豪 預先領了五一勞動節券
(28, 11, 3, 0, NULL), -- 李佳欣 是VIP，有專屬券
(29, 12, 10, 0, NULL),-- 王俊廷 領了春季券
(30, 13, 10, 0, NULL),-- 郭雅婷 領了春季券
(31, 14, 13, 0, NULL),-- 方彥霖 預先領了端午節券
(32, 15, 10, 0, NULL),-- 唐詩涵 領了春季券
(33, 16, 10, 0, NULL),-- 羅建志 領了春季券
(34, 17, 11, 0, NULL),-- 何雅琪 領了白色情人節券
(35, 18, 10, 0, NULL),-- 蕭志遠 領了春季券
(36, 19, 10, 0, NULL),-- 江淑君 領了春季券
(37, 20, 1, 0, NULL),  -- 白承翰 新會員禮沒用
(38, 20, 4, 0, NULL),  -- 白承翰 放過期的開幕慶券(過期)
(39, 21, 5, 0, NULL),  -- 彭雅文 放過期的母親節券(過期)
(40, 22, 7, 0, NULL);  -- 宋冠宇 放過期的聖誕券(過期)

SET IDENTITY_INSERT [dbo].[MemberCoupons] OFF;
GO